outputs/qwen36-35b-a3b-fp8_pro5000_8x72g_input-4k-output-1k_cand32_baseline/results/c014/bench_c2_warmup_20260830-223503.log
$ python -m sglang.bench_serving --backend sglang --dataset-name random-ids --random-range-ratio 1.0 --host 127.0.0.1 --port 30001 --model /data/autotune/models/Qwen3.6-35B-A3B-FP8 --dataset-path '' --max-concurrency 2 --random-input-len 4096 --random-output-len 1024 --output-file /workspace/outputs/c014/bench_c2_warmup_20260830-223503.jsonl --num-prompts 8
# exit code: 0

----- stdout -----
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=8, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=2, output_file='/workspace/outputs/c014/bench_c2_warmup_20260830-223503.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=8, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=2, output_file='/workspace/outputs/c014/bench_c2_warmup_20260830-223503.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 32768
#Output tokens: 8192
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 2         
Successful requests:                     8         
Benchmark duration (s):                  12.65     
Total input tokens:                      32768     
Total input text tokens:                 32768     
Total generated tokens:                  8192      
Total generated tokens (retokenized):    8181      
Request throughput (req/s):              0.63      
Input token throughput (tok/s):          2591.09   
Output token throughput (tok/s):         647.77    
Peak output token throughput (tok/s):    862.00    
Peak concurrent requests:                4         
Total token throughput (tok/s):          3238.86   
Concurrency:                             1.95      
Accept length:                           3.76      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   3076.06   
Median E2E Latency (ms):                 2965.63   
P90 E2E Latency (ms):                    3585.21   
P95 E2E Latency (ms):                    3659.64   
P99 E2E Latency (ms):                    3719.18   
---------------Time to First Token----------------
Mean TTFT (ms):                          343.51    
Median TTFT (ms):                        152.44    
P90 TTFT (ms):                           889.69    
P95 TTFT (ms):                           930.66    
P99 TTFT (ms):                           963.43    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2.67      
Median TPOT (ms):                        2.64      
P90 TPOT (ms):                           2.90      
P95 TPOT (ms):                           3.00      
P99 TPOT (ms):                           3.08      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           2.67      
Median ITL (ms):                         2.42      
P90 ITL (ms):                            2.52      
P95 ITL (ms):                            3.31      
P99 ITL (ms):                            9.86      
Max ITL (ms):                            127.90    
==================================================

----- stderr -----
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(

  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:03<00:24,  3.52s/it]
 25%|██▌       | 2/8 [00:03<00:09,  1.58s/it]
 38%|███▊      | 3/8 [00:06<00:09,  1.98s/it]
 50%|█████     | 4/8 [00:06<00:05,  1.29s/it]
 62%|██████▎   | 5/8 [00:08<00:05,  1.73s/it]
 75%|███████▌  | 6/8 [00:09<00:02,  1.27s/it]
 88%|████████▊ | 7/8 [00:11<00:01,  1.72s/it]
100%|██████████| 8/8 [00:12<00:00,  1.39s/it]
100%|██████████| 8/8 [00:12<00:00,  1.58s/it]